EqUiNoX-Labs/Reminder/firmware/sdkconfig.defaults.esp32s3
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Optimize for speed (PicoTTS / speech recognition are CPU-bound).
CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_MEM_SIZE_KILOBYTES=96

CONFIG_PICOTTS_LANGUAGE_EN_US=y
CONFIG_PICOTTS_RESOURCE_MODE_EMBED=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PicoTTS runs a long CPU-bound loop on core 1; don't WDT-trip IDLE1.
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

CONFIG_SR_MN_EN_MULTINET6_QUANT=y
CONFIG_SR_MN_CN_NONE=y
